
const Preimushestva = () => {
	return (
		<section className='py-12 mt-10' id="preimushestva">
			<div className='container mx-auto'>

				<div className='text-center mb-14'>
					<h5 className='text-gradient bg-gradient-to-r from-blue-500 to-fuchsia-600 text-transparent bg-clip-text  font-bold text-3xl'>
						Преимущества нашего СТО
					</h5>
				</div>

				<div className='grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-6 lg:gap-8 xl:gap-10'>

					<div className="card bg-base-200 transform-gpu transition-all duration-300 hover:-translate-y-2 hover:shadow-lg">
						<div className="card-body items-center text-center gap-4">
							<a href="#/">
								<svg t="1698344279778" className="fill-current" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10154" width="105" height="105"><path d="M908.8 537.6c-6.4-57.6-38.4-121.6-96-160C780.8 352 742.4 332.8 704 320c-6.4 6.4-12.8 12.8-19.2 19.2-6.4 6.4-19.2 12.8-32 19.2 12.8 0 25.6 6.4 32 12.8C697.6 371.2 704 384 697.6 390.4c-6.4 6.4-19.2 12.8-25.6 6.4-70.4-25.6-153.6-25.6-192-19.2C467.2 384 460.8 377.6 454.4 364.8l0 0c0-12.8 6.4-19.2 19.2-19.2 6.4 0 12.8 0 25.6 0 0 0-6.4-6.4-6.4-6.4C480 326.4 467.2 313.6 460.8 300.8c0 0 0 0 0-6.4C448 300.8 435.2 300.8 428.8 300.8c-64-32-134.4-32-179.2-25.6-19.2 0-32 19.2-19.2 32l38.4 64C224 403.2 192 441.6 172.8 480L128 480c-12.8 0-25.6 12.8-25.6 25.6l0 83.2c0 6.4 6.4 19.2 12.8 19.2l57.6 25.6c25.6 57.6 76.8 102.4 140.8 140.8l0 76.8c0 12.8 12.8 25.6 32 25.6l83.2 0c12.8 0 25.6-6.4 32-12.8l19.2-38.4c19.2 0 38.4 0 51.2 0 32 0 57.6 0 83.2-6.4l0 32c0 12.8 12.8 25.6 32 25.6l83.2 0c12.8 0 25.6-6.4 25.6-12.8 44.8-70.4 89.6-134.4 128-204.8C902.4 614.4 908.8 576 908.8 537.6L908.8 537.6 908.8 537.6zM320 518.4c-25.6 0-38.4-12.8-38.4-32C281.6 467.2 300.8 448 320 448c25.6 0 38.4 12.8 38.4 32C364.8 505.6 345.6 518.4 320 518.4L320 518.4 320 518.4z" fill="#7e22ce" p-id="10155"></path><path d="M544 339.2c12.8 6.4 25.6 6.4 38.4 6.4 6.4 0 12.8 0 19.2 0 25.6-6.4 51.2-19.2 70.4-38.4 12.8-12.8 19.2-32 19.2-57.6 0-51.2-51.2-96-108.8-96-64 0-108.8 44.8-108.8 96 0 12.8 6.4 25.6 6.4 38.4C499.2 313.6 518.4 332.8 544 339.2L544 339.2 544 339.2z" fill="#7e22ce" p-id="10156"></path></svg>
							</a>
							<h4 className="card-title text-purple-700">Доступные цены</h4>
							<p className="text-sm base-content">
								Наше СТО выделяется высоким уровнем профессионализма и доступными ценами на ремонт автомобилей. Мы гордимся тем, что предоставляем клиентам качественные услуги по низким рыночным ценам, делая техническое обслуживание доступным для всех. При выборе нашей станции вы можете быть уверены в отличном сервисе и экономии без потери качества.
							</p>
						</div>
					</div>

					<div className="card bg-base-200 transform-gpu transition-all duration-300 hover:-translate-y-2 hover:shadow-lg">
						<div className="card-body items-center text-center gap-4">
							<a href="#/">
								<svg t="1698344822546" className="fill-current" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="13385" width="100" height="100"><path d="M352 848m-144 0a144 144 0 1 0 288 0 144 144 0 1 0-288 0Z" p-id="13386" fill="#a21caf"></path><path d="M768 848m-144 0a144 144 0 1 0 288 0 144 144 0 1 0-288 0Z" p-id="13387" fill="#a21caf"></path><path d="M704 182.08V128a64 64 0 0 0-64-64H192a64 64 0 0 0-64 64v32H80a48 48 0 0 0 0 96H256a48 48 0 0 1 0 96H96a48 48 0 0 0 0 96h256a48 48 0 0 1 0 96H128v144a64 64 0 0 0 27.52 52.48A217.28 217.28 0 0 1 352 632 200.64 200.64 0 0 1 553.6 768h13.12A200.64 200.64 0 0 1 768 632a220.8 220.8 0 0 1 196.16 112.32 72.32 72.32 0 0 0 27.84-56.96v-160a352 352 0 0 0-288-345.28zM704 544V280.32A275.52 275.52 0 0 1 896 544z" fill="#a21caf" p-id="13388"></path></svg>
							</a>
							<h4 className="card-title text-fuchsia-700">
								Быстрая доставка
							</h4>
							<p className="text-sm base-content">
								Выбрав наш автосервис, вы получаете не только высококачественный ремонт, но и оперативный доступ к автозапчастям. В случае отсутствия необходимых деталей у нас, мы гарантируем оперативную доставку по оптовым ценам, обеспечивая ваш автомобиль наилучшими запчастями в кратчайшие сроки. Наше стремление к полному удовлетворению клиентов отражается не только в профессионализме, но и в заботе о каждой детали вашего авторемонта.
							</p>
						</div>
					</div>

					<div className="card bg-base-200 transform-gpu transition-all duration-300 hover:-translate-y-2 hover:shadow-lg">
						<div className="card-body items-center text-center gap-4">
							<a href="#/">
								<svg t="1701353843332" className="fill-current" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7180"  width="100" height="100"><path d="M484.990983 390.89528s-44.600063-30.207441-123.825855 4.892354c-104.351253 46.192922-86.412622-131.600526-193.873743-167.686377 0 0-108.485102 0-155.303791 179.898299 0 0-36.768504 116.809689 18.526472 270.482694v265.154201s55.276013 84.762875 138.218478 0v-269.079461s-1.194645-167.686376 61.912927-230.054407c0 0 14.184034 58.51862 121.626192 54.612322 0 0 237.942853-33.127683 132.71932-108.219625zM260.928762 241.7733c67.506898 0 122.270921-54.100331 122.270921-120.867687C383.218646 54.119294 328.43566 0 260.928762 0 193.421864 0 138.714729 54.119294 138.714729 120.88665c0 66.748394 54.74506 120.867688 122.232996 120.867688z m481.896854 413.821078c-102.872169 0-186.269736 82.449436-186.269736 184.202811 0 101.753375 83.397567 184.202811 186.269736 184.202811C845.754673 1023.981037 929.171202 941.531601 929.171202 839.778226c0-101.753375-83.416529-184.202811-186.326624-184.202811z m0 268.965686c-47.349642 0-85.729968-37.963149-85.729968-84.762875s38.380326-84.762875 85.729968-84.762875c47.387567 0 85.748931 37.963149 85.74893 84.762875s-38.361364 84.762875-85.74893 84.762875z" fill="#00dc93" p-id="7181"></path><path d="M1137.759932 309.773226h-0.493028c0-25.789152-20.669247-46.666988-46.154997-46.666987-2.332401 0-4.626877 0.189626-6.864466 0.51199v-0.341327l-1.706635 0.644729a45.491306 45.491306 0 0 0-14.487435 5.423307l-279.357197 104.673617c-6.542101-28.766282-256.848577-297.068277-319.975112-255.976297-45.320642 29.467899-6.883428 76.343475-6.883428 76.343476 84.44051 20.517546 248.049925 211.262458 248.049925 211.262458l-260.527323 99.857113C418.508066 525.055758 360.292848 525.055758 360.292848 628.781245v146.770615C360.292848 820.948353 416.877282 872.280143 462.292737 872.280143h43.670895c-0.777467 0-1.175682-19.910742-1.175682-27.818152 0-127.239125 103.194533-232.557471 230.509509-232.557471 127.333938 0 230.528472 106.380252 230.528472 233.676266 0 7.907409-0.398215 26.699357-1.175682 26.699357h127.826966v-0.587841a46.401511 46.401511 0 0 0 44.751764-44.296661H1137.759932V309.773226zM429.999409 627.302161c-49.928557-96.861021 152.705913-102.246403 152.705913-102.246403l-152.705913 102.246403z" fill="#00dc93" p-id="7182"></path></svg>
							</a>
							<h4 className="card-title text-[#00dc93]">
								Быстрый и аккуратный ремонт
							</h4>
							<p className="text-sm base-content">
								Выбирая наш сервис, вы получаете быстрый и аккуратный ремонт вашего автомобиля. Наши опытные мастера оперативно выявляют неисправности, а использование высококачественных запчастей гарантирует долгосрочную надежность вашего транспортного средства. Мы ценим ваше время и предоставляем услуги, ориентированные на эффективность и безупречное качество.
							</p>
						</div>
					</div>
				</div>

			</div>
		</section>
	)
}

export default Preimushestva;